In [1]:
#IMPORT LIBRARIES
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
sns.set()
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

In [2]:
pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: openpyxl in c:\programdata\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\programdata\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
df = pd.read_excel('Data_Train 2.xlsx')

In [6]:
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,Null,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,Null,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,Null,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,Null,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,Null,13302

In [7]:
df.tail()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
10678,Air Asia,9/04/2019,Kolkata,Banglore,CCU → BLR,19:55,22:25,2h 30m,non-stop,Null,4107
10679,Air India,27/04/2019,Kolkata,Banglore,CCU → BLR,20:45,23:20,2h 35m,non-stop,Null,4145
10680,Jet Airways,27/04/2019,Banglore,Delhi,BLR → DEL,08:20,11:20,3h,non-stop,Null,7229
10681,Vistara,01/03/2019,Banglore,New Delhi,BLR → DEL,11:30,14:10,2h 40m,non-stop,Null,12648
10682,Air India,9/05/2019,Delhi,Cochin,DEL → GOI → BOM → COK,10:55,19:15,8h 20m,2 stops,Null,11753

Feature Information
Airline: Name of the Airline from which the Ticket is Booked.
Date_of_Journey: Date of Journey of the Traveller.
Source: Source from which the Airline Would Departure.
Destination: Destination to Which Airline Would Arrive.
Route: Route of the Airline from Source to Destination.
Dep_Time: Time at which Flight Would Departure from the Source.
Arrival_Time: Time at which Flight Would Arrive at the Destination.
Duration: Duration that Airline Takes to fly from Source to Destination.
Total_Stops: Total No of Stops that Airline takes Between Source and Destination.
Additional_Info: Any Additional Info about the Airline.
Price: Fare of the Ticket to fly from Source to Destination.

In [8]:
df.shape

(10683, 11)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

In [10]:
df.describe(include=['O']).T

                 count unique              top  freq
Airline          10683     12      Jet Airways  3849
Date_of_Journey  10683     44       18/05/2019   504
Source           10683      5            Delhi  4537
Destination      10683      6           Cochin  4537
Route            10682    128  DEL → BOM → COK  2376
Dep_Time         10683    222            18:55   233
Arrival_Time     10683   1343            19:00   423
Duration         10683    368           2h 50m   550
Total_Stops      10682      5           1 stop  5625
Additional_Info  10683     10             Null  8347

In [11]:
df.describe()

              Price
count  10683.000000
mean    9087.064121
std     4611.359167
min     1759.000000
25%     5277.000000
50%     8372.000000
75%    12373.000000
max    79512.000000

In [12]:
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,Null,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,Null,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,Null,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,Null,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,Null,13302

In [13]:
for i in df.columns:
    print(f'The value counts for each {i} is ',df[i].value_counts(),sep = '\n')
    print('-------------------------------------------------------')

The value counts for each Airline is
Airline
Jet Airways                          3849
IndiGo                               2053
Air India                            1752
Multiple carriers                    1196
SpiceJet                              818
Vistara                               479
Air Asia                              319
GoAir                                 194
Multiple carriers Premium economy      13
Jet Airways Business                    6
Vistara Premium economy                 3
Trujet                                  1
Name: count, dtype: int64
-------------------------------------------------------
The value counts for each Date_of_Journey is
Date_of_Journey
18/05/2019    504
6/06/2019     503
21/05/2019    497
9/06/2019     495
12/06/2019    493
9/05/2019     484
21/03/2019    423
15/05/2019    405
27/05/2019    382
27/06/2019    355
24/06/2019    351
1/06/2019     342
3/06/2019     333
15/06/2019    328
24/03/2019    323
6/03/2019     308
27/03/2019    299
24/05/2019    286
6/05/2019     282
1/05/2019     277
12/05/2019    259
1/04/2019     257
3/03/2019     218
9/03/2019     200
15/03/2019    162
18/03/2019    156
01/03/2019    152
12/03/2019    142
9/04/2019     125
3/04/2019     110
21/06/2019    109
18/06/2019    105
09/03/2019    102
6/04/2019     100
03/03/2019     97
06/03/2019     95
27/04/2019     94
24/04/2019     92
3/05/2019      90
15/04/2019     89
21/04/2019     82
18/04/2019     67
12/04/2019     63
1/03/2019      47
Name: count, dtype: int64
-------------------------------------------------------
The value counts for each Source is
Source
Delhi       4537
Kolkata     2871
Banglore    2197
Mumbai       697
Chennai      381
Name: count, dtype: int64
-------------------------------------------------------
The value counts for each Destination is
Destination
Cochin       4537
Banglore     2871
Delhi        1265
New Delhi     932
Hyderabad     697
Kolkata       381
Name: count, dtype: int64
-------------------------------------------------------
The value counts for each Route is
Route
DEL → BOM → COK          2376
BLR → DEL                1552
CCU → BOM → BLR           979
CCU → BLR                 724
BOM → HYD                 621
                         ...
CCU → VTZ → BLR             1
CCU → IXZ → MAA → BLR       1
BOM → COK → MAA → HYD       1
BOM → CCU → HYD             1
BOM → BBI → HYD             1
Name: count, Length: 128, dtype: int64
-------------------------------------------------------
The value counts for each Dep_Time is
Dep_Time
18:55    233
17:00    227
07:05    205
10:00    203
07:10    202
        ...
16:25      1
01:35      1
21:35      1
04:15      1
03:00      1
Name: count, Length: 222, dtype: int64
-------------------------------------------------------
The value counts for each Arrival_Time is
Arrival_Time
19:00           423
21:00           360
19:15           333
16:10           154
12:35           122
               ...
00:25 02 Jun      1
08:55 13 Mar      1
11:05 19 May      1
12:30 22 May      1
21:20 13 Mar      1
Name: count, Length: 1343, dtype: int64
-------------------------------------------------------
The value counts for each Duration is
Duration
2h 50m     550
1h 30m     386
2h 45m     337
2h 55m     337
2h 35m     329
          ...
31h 30m      1
30h 25m      1
42h 5m       1
4h 10m       1
47h 40m      1
Name: count, Length: 368, dtype: int64
-------------------------------------------------------
The value counts for each Total_Stops is
Total_Stops
1 stop      5625
non-stop    3491
2 stops     1520
3 stops       45
4 stops        1
Name: count, dtype: int64
-------------------------------------------------------
The value counts for each Additional_Info is
Additional_Info
Null                            8347
In-flight meal not included     1982
No check-in baggage included     320
1 Long layover                    19
Change airports                    7
Business class                     4
Null                               1
1 Short layover                    1
Red-eye flight                     1
2 Long layover                     1
Name: count, dtype: int64
-------------------------------------------------------
The value counts for each Price is
Price
10262    258
10844    212
7229     162
4804     160
4823     131
        ...
14153      1
8488       1
7826       1
6315       1
12648      1
Name: count, Length: 1870, dtype: int64
-------------------------------------------------------

###  Percantage of null values in additional_info column.

In [14]:
#calculate percentage of null values in additional_info
factor = len(df[(df['Additional_Info']=='Null ')|(df['Additional_Info']=='Null')])/len(df['Additional_Info'])
factor*100

78.14284377047646

### Drop Additional_Info column

In [15]:
# Dropping the column Additional_Info as it has more than 75% missing data 

df =df.drop(columns = ['Additional_Info'])

### Drop null values

In [16]:
# Dropping the null values

df.dropna(inplace= True)

In [17]:
df.isna().sum()

Airline            0
Date_of_Journey    0
Source             0
Destination        0
Route              0
Dep_Time           0
Arrival_Time       0
Duration           0
Total_Stops        0
Price              0
dtype: int64

###  Drop duplicated values

In [18]:
# Checking for the duplicated values

df.duplicated().sum()

220

In [19]:
# Dropping the Duplicate values

df.drop_duplicates(inplace=True)

In [20]:
df.duplicated().sum()

0

In [21]:
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,13302

In [22]:
# First we need to convert the Date_of_Journey colum to datetime dtype which is in object dtype

df['Date_of_Journey'] = pd.to_datetime(df['Date_of_Journey'],format="%d/%m/%Y")

In [23]:
# extracting day,month,year,week_name from the Date_of_Journey column

df['day'] = pd.to_datetime(df.Date_of_Journey, format="%d/%m/%Y").dt.day
df['month'] = pd.to_datetime(df.Date_of_Journey, format="%d/%m/%Y").dt.month
df['year'] = pd.to_datetime(df.Date_of_Journey, format="%d/%m/%Y").dt.year
df['week_name'] = pd.to_datetime(df['Date_of_Journey']).dt.day_name()

In [24]:
# Extracting hours and min from Dep_Time column

df['dep_hour'] = pd.to_datetime(df.Dep_Time).dt.hour
df['dep_min'] = pd.to_datetime(df.Dep_Time).dt.minute

In [25]:
# Before extracting the hours and min from Arrival_Time column need to exclude the day for few values.

df['Arrival_Time'] = df['Arrival_Time'].str.split().str[0]

In [26]:
# Before extracting the hours and min from Arrival_Time column need to exclude the day for few values.

df['Arrival_Time'] = df['Arrival_Time'].str.split().str[0]

In [27]:
# Extracting hours and min from Arrival_Time column

df['arrival_hour'] = pd.to_datetime(df.Arrival_Time).dt.hour
df['arrival_min'] = pd.to_datetime(df.Arrival_Time).dt.minute

In [28]:
# Here before extracting the hours and min we need to keep min as 0 where we have only hour values and vice-versa

duration = list(df['Duration'])

for i in range(len(duration)):
    if (len(duration[i].split()) != 2):
        if 'h' in duration[i]:
             duration[i] = duration[i].strip() + ' 0m'
        else:
            duration[i] = "0h " + duration[i]

In [29]:
df['Duration'] = duration

In [30]:
# Extracting hours and min from Duration column

df['duration_hour'] = [i.split("h")[0] for i in df["Duration"]]
df['duration_min'] = [i.split("h")[1].split('m')[0].strip() for i in df["Duration"]]

In [31]:
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Price,day,month,year,week_name,dep_hour,dep_min,arrival_hour,arrival_min,duration_hour,duration_min
0,IndiGo,2019-03-24,Banglore,New Delhi,BLR → DEL,22:20,01:10,2h 50m,non-stop,3897,24,3,2019,Sunday,22,20,1,10,2,50
1,Air India,2019-05-01,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,7662,1,5,2019,Wednesday,5,50,13,15,7,25
2,Jet Airways,2019-06-09,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25,19h 0m,2 stops,13882,9,6,2019,Sunday,9,25,4,25,19,0
3,IndiGo,2019-05-12,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,6218,12,5,2019,Sunday,18,5,23,30,5,25
4,IndiGo,2019-03-01,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,13302,1,3,2019,Friday,16,50,21,35,4,45

In [32]:
# Merging Airline row

df['Airline'].unique()

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

In [33]:
df['Airline'].value_counts()

Airline
Jet Airways                          3700
IndiGo                               2043
Air India                            1694
Multiple carriers                    1196
SpiceJet                              815
Vistara                               478
Air Asia                              319
GoAir                                 194
Multiple carriers Premium economy      13
Jet Airways Business                    6
Vistara Premium economy                 3
Trujet                                  1
Name: count, dtype: int64

Here let us try to combine the Multiple carriers Premium economy, Jet Airways Business and Vistara Premium economy by seeing how the mean varies for these rows and we will decide further.

In [34]:
vistara_prem_mean = df.loc[df['Airline']=='Vistara Premium economy', 'Price'].mean()
print('Mean Price for Vistara Premium econom is:',vistara_prem_mean)

Mean Price for Vistara Premium econom is: 8962.333333333334

In [35]:
vistara_mean = df.loc[df['Airline']=='Vistara', 'Price'].mean()
print('Mean Price for Vistara is:',vistara_mean)

Mean Price for Vistara is: 7801.355648535565

In [36]:
df['Airline'] = df['Airline'].replace('Vistara Premium economy','Vistara')

In [37]:
Multiple_carriers_Premium_economy_mean = df.loc[df['Airline']=='Multiple carriers Premium economy', 'Price'].mean()
print('Mean Price for Multiple carriers Premium economy is:',Multiple_carriers_Premium_economy_mean)

Mean Price for Multiple carriers Premium economy is: 11418.846153846154

In [38]:
Multiple_carriers_mean = df.loc[df['Airline']=='Multiple carriers', 'Price'].mean()
print('Mean Price for Multiple_carriers is:',Multiple_carriers_mean)

Mean Price for Multiple_carriers is: 10902.678093645485

In [39]:
df['Airline'] = df['Airline'].replace('Multiple carriers Premium economy','Multiple carriers')

In [40]:
Jet_Airways_Business_mean = df.loc[df['Airline']=='Jet Airways Business', 'Price'].mean()
print('Mean Price for Jet_Airways_Business is:',Jet_Airways_Business_mean)

Mean Price for Jet_Airways_Business is: 58358.666666666664

In [41]:
Jet_Airways_mean = df.loc[df['Airline']=='Jet Airways', 'Price'].mean()
print('Mean Price for Jet_Airways is:',Jet_Airways_mean)

Mean Price for Jet_Airways is: 11599.02108108108

In [42]:
# For the Jet Airways, we can't combine business class with normal class, as the price difference is huge.

Here let us try to combine the New Delhi value with Delhi in Destination

In [43]:
df['Destination'] = df['Destination'].replace('New Delhi','Delhi')

In [44]:
# Since the data has been cleaned and has no more missing value and randomness in the data, we will export the above 
# data and perform Exploratory Data Analysis(EDA)

df.to_csv('EDA_Flight_Fare.csv' ,index= False)